app/controllers/users_controller.rb

  def index
    #redirect_to :homepage
    # Eventually we will not need access to @users
    @friendships = current_user.friendships
    @friends = current_user.friendships.collect(&:friend).collect(&:username)
    @invitations_sent = current_user.sent_invitations
    @invitations_recv = Invitation.where(:recipient_email => current_user.email)
    @other_users = User.all.delete(current_user)
---
SELECT "users".* FROM "users"

  def create
    @user = User.new(params[:user])
    puts params[:user]
    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "crypted_password", "email", "password_salt", "persistence_token", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "users" SET "email" = 'anil@yahoo.com', "updated_at" = '2011-09-11 03:41:50.494188' WHERE "users"."id" = 2